i this is haris practice note book

In [1]:
import pandas as pd  # Data frame operations 
import numpy as np    # Math operations 
import matplotlib.pyplot as plt  # Diagrams / plots
import seaborn as sns          # Diagrams / plots

In [ ]:
# data set name: visadataset
# read csv file : comma separeated value
# extension : csv
# you can read this using pandas package
# read excel file
# extension: .xlsx

In [1]:
# path 
# file location + filename + extension
path = r'C:\Users\kanch\OneDrive\Naresh IT\Data science\data files\Visadataset.csv'

In [5]:
pd.read_csv(path)

OSError: [Errno 22] Invalid argument

In [8]:
# Can you do bank data
# data set name = bank
path = r'C:\Users\kanch\OneDrive\Naresh IT\data files\bank - bank.csv'
pd.read_csv(path, 
            sep = ',')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

# Creat dataframes using List

In [9]:
name = ['Ramesh','Suresh','Sathish']
age = [30,35,40]
name, age

(['Ramesh', 'Suresh', 'Sathish'], [30, 35, 40])

**Step-1**

$create$ $dataframe$

In [27]:
pd.DataFrame()   # make the dataframe

Empty DataFrame
Columns: []
Index: []

**Step-2**

$provide$ $data$

In [10]:
pd.DataFrame(zip(name,age))

         0   1
0   Ramesh  30
1   Suresh  35
2  Sathish  40

**Step-3**

$provide$ $columns$

In [11]:
data = zip(name,age)
cols = ['Name','Age']
pd.DataFrame(data,columns = cols)
#pd.DataFrame(zip(name,age),columns=['Name','Age'])

      Name  Age
0   Ramesh   30
1   Suresh   35
2  Sathish   40

**Step-4**

$𝑝𝑟𝑜𝑣𝑖𝑑𝑒$ $𝑖𝑛𝑑𝑒𝑥$

In [12]:
data = zip(name,age)
cols=['Name','Age']
ind = ['A','B','C']
pd.DataFrame(data, columns=cols, index = ind)

      Name  Age
A   Ramesh   30
B   Suresh   35
C  Sathish   40

**Step-5**

$Add$ $new$ $column$

In [14]:
name = ['Ramesh','Suresh','Sathish']
age = [30,35,40]

data = zip(name,age)
cols = ['Name', 'Age']
ind = ['A','B','C']
df = pd.DataFrame (data,columns = cols, index = ind)
df

      Name  Age
A   Ramesh   30
B   Suresh   35
C  Sathish   40

- if you want to add a new column

- df['new column']

- you need to have a list which is having some elements

- that elements need to equal to number of rows

- city_names=['Hyd','Blr','Chennai']

- df['city']=city_names

In [17]:
city_names = ['Hyd','Blr','Chennai']
df['city'] = ['Hyd','Blr','Chennai']
df

      Name  Age     city
A   Ramesh   30      Hyd
B   Suresh   35      Blr
C  Sathish   40  Chennai

**Step-6**

$update$ $the$ $exsisting$ $column$

- if you want to create new column or update the old column

- both are same way

In [18]:
df['Name'] = ['Swamy','Asif','Sathwik']
df

      Name  Age     city
A    Swamy   30      Hyd
B     Asif   35      Blr
C  Sathwik   40  Chennai

**Step-7**

$drop$ $the$ $column$

- In order to drop the column

- We need to use  drop method

- It takes 3 parameters

    - drop column or row
    
    - mention the column name
    
    - axis
    
        - axis=1 reference as column
        
        - axis=0 reference as row
        
    - you want to create a new dataframe or
    
    - you want overwrite the existing dataframe
    
        - inplace= True

In [ ]:
df.drop('city',   # column name 
       axis = 1,   # Column
      inplace = True)  # overwirte the same

In [19]:
df

      Name  Age     city
A    Swamy   30      Hyd
B     Asif   35      Blr
C  Sathwik   40  Chennai

$Step-8$

**Drop rows**

In [21]:
df.drop('C', # column name 
       axis = 0,  # row
       inplace = True) # overtime the same 

df

    Name  Age city
A  Swamy   30  Hyd
B   Asif   35  Blr

**Step-9**

$save$ $the$ $dataframe$

In [22]:
df.to_csv('output.csv')
# while saving index consider as extra column
df.to_excel('output.xlsx')

In [23]:
# read output csv
pd.read_csv('output.csv')

  Unnamed: 0   Name  Age city
0          A  Swamy   30  Hyd
1          B   Asif   35  Blr

Step-10

𝑅𝑒𝑚𝑜𝑣𝑒
 𝑇ℎ𝑒
  𝐼𝑛𝑑𝑒𝑥

In [24]:
# To avoid the above problem
# give index = False
df.to_csv('output.csv',index = False)

In [25]:
pd.read_csv('output.csv')

    Name  Age city
0  Swamy   30  Hyd
1   Asif   35  Blr

# Creat dataframes using dictionary

In [26]:
d1 = {'NAME': ['Ramesh','Suresh','Sathish'],
     'AGE': [30,35,40]}

pd.DataFrame(d1)

# No need of Zip
# No need of column names

      NAME  AGE
0   Ramesh   30
1   Suresh   35
2  Sathish   40

In [ ]:
# creat a dataFrame

In [42]:
dataset = {'Names': ['Hari','Swamy','Anil','Ravi'],
          'Age': [23,25,30,35]}
dataset

{'Names': ['Hari', 'Swamy', 'Anil', 'Ravi'], 'Age': [23, 25, 30, 35]}

In [43]:

df = pd.DataFrame(dataset)
df

   Names  Age
0   Hari   23
1  Swamy   25
2   Anil   30
3   Ravi   35

In [44]:
df.Names = ['Math','Eng','Tel','Sceince']
df

     Names  Age
0     Math   23
1      Eng   25
2      Tel   30
3  Sceince   35

In [51]:
df1=df.rename(columns={'Names':'Subject'})

In [52]:
df1

   Subject  Age
0     Math   23
1      Eng   25
2      Tel   30
3  Sceince   35

In [53]:
df1=df1.rename(columns = {'Age':'Marks'})

In [54]:
df1

   Subject  Marks
0     Math     23
1      Eng     25
2      Tel     30
3  Sceince     35

In [57]:
df1.loc[4]=['Hindi','50']
df1

   Subject Marks
0     Math    23
1      Eng    25
2      Tel    30
3  Sceince    35
4    Hindi    50